pingwcy/STM32F103ZET6-DEMO/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "../../BSP/lcd/lcd.h"
#include "stm32f1xx_hal.h"  // HAL库主头文件
#include "../../BSP/TOUCH/touch.h"
#include "../../BSP/NORFLASH/norflash.h"
#include "../../BSP/REMOTE/remote.h"
#include "../../BSP/24CXX/24cxx.h"
#include "../../BSP/LSENS/lsens.h"
#include "FreeRTOS.h"
#include "queue.h"
#include "event_groups.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum {
    LED_OFF,
    LED_ON,
    LED_BLINK
} LedMode_t;

volatile LedMode_t led_mode = LED_OFF;
uint32_t last_tick = 0;
uint32_t last_tick2 = 0;

extern uint8_t g_remote_sta;

#define TOUCH_EVENT        (1 << 0)
#define UART_REVERT_EVENT  (1 << 1)

uint32_t last_debounce_time = 0;
uint8_t last_btn_state1 = 1;
uint8_t last_btn_state2 = 1;
uint8_t last_btn_state3 = 1;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LED_PIN GPIO_PIN_5      // PE5 (用户控制LED)
#define LED_PORT GPIOE
#define BTN_PIN1 GPIO_PIN_3     // PE3 (按键1)
#define BTN_PIN2 GPIO_PIN_4     // PE4 (按键2)
#define BTN_PORT GPIOE

#define BTN_PIN0 GPIO_PIN_0     // PA0 (按键0)
#define BTN_PORT0 GPIOA

#define PB5_LED_PIN GPIO_PIN_5  // PB5 (�??????机常亮LED)
#define PB5_LED_PORT GPIOB
#define BEEP_PIN GPIO_PIN_8
#define BEEP_PORT GPIOB
#define BEEP_SHORT_BEEP_TIME 100  // 蜂鸣时长(ms)

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;

I2C_HandleTypeDef hi2c1;

IWDG_HandleTypeDef hiwdg;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;

SRAM_HandleTypeDef hsram1;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */

uint8_t tx_e3 = 0xE3;
uint8_t tx_e4 = 0xE4;
uint8_t tx_a0 = 0xA0;
volatile uint8_t tx_request_byte = 0;
volatile uint8_t tx_request_flag = 0;
volatile uint8_t uart_rx_flag = 0;

uint8_t close_red = 0;  // 改为全局变量

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_RTC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_FSMC_Init(void);
static void MX_IWDG_Init(void);
static void MX_ADC3_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM2_Init(void);
void StartDefaultTask(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// 设置日期和时�???
void Set_RTC_DateTime(uint8_t year, uint8_t month, uint8_t day, uint8_t hour, uint8_t minute, uint8_t second)
{
    RTC_DateTypeDef sDate = {0};
    RTC_TimeTypeDef sTime = {0};

    sDate.Year = year;
    sDate.Month = month;
    sDate.Date = day;
    sDate.WeekDay = RTC_WEEKDAY_MONDAY; // 根据实际情况设置

    sTime.Hours = hour;
    sTime.Minutes = minute;
    sTime.Seconds = second;
    //sTime.SubSeconds = 0;
    //sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
    //sTime.StoreOperation = RTC_STOREOPERATION_RESET;

    if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK)
    {
        Error_Handler();
    }

    if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK)
    {
        Error_Handler();
    }
}

// 获取当前日期和时�???
void Get_RTC_DateTime(uint8_t *year, uint8_t *month, uint8_t *day,
                      uint8_t *hour, uint8_t *minute, uint8_t *second)
{
    RTC_DateTypeDef sDate = {0};
    RTC_TimeTypeDef sTime = {0};

    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

    *year = sDate.Year;
    *month = sDate.Month;
    *day = sDate.Date;
    *hour = sTime.Hours;
    *minute = sTime.Minutes;
    *second = sTime.Seconds;
}
// 在合适的位置添加中断处理函数

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    uint32_t current_tick = HAL_GetTick();
    if((current_tick - last_debounce_time) > 50) {
        if(GPIO_Pin == BTN_PIN1) {
            tx_request_byte = 0xE3; tx_request_flag = 1;
            if(led_mode != LED_ON) { led_mode = LED_ON; HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET);}
            else { led_mode = LED_OFF; HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_RESET); }
        }
        else if(GPIO_Pin == BTN_PIN2) {
            tx_request_byte = 0xE4; tx_request_flag = 1;
            led_mode = LED_BLINK;
        }
        else if(GPIO_Pin == BTN_PIN0) {
            tx_request_byte = 0xA0; tx_request_flag = 1;
            HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_0);
        }
        last_debounce_time = current_tick;
    }
}
void USART1_IRQHandler(void)
{
    HAL_UART_IRQHandler(&huart1);
}

// 添加UART接收完成回调
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART1) {
        uart_rx_flag = 1;
    }
}
void delay_init(uint16_t sysclk)
{
    //g_fac_us = sysclk;
}

void delay_us(uint32_t nus)
{
    uint32_t start = __HAL_TIM_GET_COUNTER(&htim2);
    while ((__HAL_TIM_GET_COUNTER(&htim2) - start) < nus)
    {
        // 等待
    }
}

void delay_ms(uint16_t nms)
{

    delay_us((uint32_t)(nms * 1000));
}

//void HAL_Delay(uint32_t Delay)
//{
//     delay_ms(Delay);
//}

