pingwcy/STM32F103ZET6-DEMO/Core/Src/main.c
		        if (k == 20){
		            k = 0;
		            Get_RTC_DateTime(&year, &month, &day, &hour, &minute, &second);
		            char datetime[25];
		            snprintf(datetime, sizeof(datetime),
		                     "%04d-%02d-%02d %02d:%02d:%02d",
		                     (int)year + 1970,
		                     (int)month,
		                     (int)day,
		                     (int)hour,
		                     (int)minute,
		                     (int)second);
		            lcd_show_string(10, 170, 240, 16, 16, datetime, RED);
		            adcx = lsens_get_val();
		            lcd_show_xnum(90, 190, adcx, 3, 16, 0, BLUE);
		        }

		        osDelay(10); // FreeRTOS 任务延时代替 HAL_Delay
		    }
	  }
	  /* USER CODE END 5 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM7 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM7)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
  if (htim->Instance == TIM4)
  {
      if (g_remote_sta & 0x80)      /* �ϴ������ݱ����յ��� */
      {
          g_remote_sta &= ~0X10;    /* ȡ���������Ѿ��������� */

          if ((g_remote_sta & 0X0F) == 0X00)
          {
              g_remote_sta |= 1 << 6; /* ����Ѿ����һ�ΰ����ļ�ֵ��Ϣ�ɼ� */
          }

          if ((g_remote_sta & 0X0F) < 14)
          {
              g_remote_sta++;
          }
          else
          {
              g_remote_sta &= ~(1 << 7);    /* ���������ʶ */
              g_remote_sta &= 0XF0;         /* ��ռ����� */
          }
      }
  }

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
